Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
#define ADC10SHT_0             (0*0x100u)     /* ADC10 Sample Hold Select 0 */
#define ADC10SHT_1             (1*0x100u)     /* ADC10 Sample Hold Select 1 */
#define ADC10SHT_2             (2*0x100u)     /* ADC10 Sample Hold Select 2 */
#define ADC10SHT_3             (3*0x100u)     /* ADC10 Sample Hold Select 3 */
#define ADC10SHT_4             (4*0x100u)     /* ADC10 Sample Hold Select 4 */
#define ADC10SHT_5             (5*0x100u)     /* ADC10 Sample Hold Select 5 */
#define ADC10SHT_6             (6*0x100u)     /* ADC10 Sample Hold Select 6 */
#define ADC10SHT_7             (7*0x100u)     /* ADC10 Sample Hold Select 7 */
#define ADC10SHT_8             (8*0x100u)     /* ADC10 Sample Hold Select 8 */
#define ADC10SHT_9             (9*0x100u)     /* ADC10 Sample Hold Select 9 */
#define ADC10SHT_10            (10*0x100u)    /* ADC10 Sample Hold Select 10 */
#define ADC10SHT_11            (11*0x100u)    /* ADC10 Sample Hold Select 11 */
#define ADC10SHT_12            (12*0x100u)    /* ADC10 Sample Hold Select 12 */
#define ADC10SHT_13            (13*0x100u)    /* ADC10 Sample Hold Select 13 */
#define ADC10SHT_14            (14*0x100u)    /* ADC10 Sample Hold Select 14 */
#define ADC10SHT_15            (15*0x100u)    /* ADC10 Sample Hold Select 15 */

/* ADC10CTL1 Control Bits */
#define ADC10BUSY              (0x0001)       /* ADC10 Busy */
#define ADC10CONSEQ0           (0x0002)       /* ADC10 Conversion Sequence Select 0 */
#define ADC10CONSEQ1           (0x0004)       /* ADC10 Conversion Sequence Select 1 */
#define ADC10SSEL0             (0x0008)       /* ADC10 Clock Source Select 0 */
#define ADC10SSEL1             (0x0010)       /* ADC10 Clock Source Select 1 */
#define ADC10DIV0              (0x0020)       /* ADC10 Clock Divider Select 0 */
#define ADC10DIV1              (0x0040)       /* ADC10 Clock Divider Select 1 */
#define ADC10DIV2              (0x0080)       /* ADC10 Clock Divider Select 2 */
#define ADC10ISSH              (0x0100)       /* ADC10 Invert Sample Hold Signal */
#define ADC10SHP               (0x0200)       /* ADC10 Sample/Hold Pulse Mode */
#define ADC10SHS0              (0x0400)       /* ADC10 Sample/Hold Source 0 */
#define ADC10SHS1              (0x0800)       /* ADC10 Sample/Hold Source 1 */

/* ADC10CTL1 Control Bits */
#define ADC10BUSY_L            (0x0001)       /* ADC10 Busy */
#define ADC10CONSEQ0_L         (0x0002)       /* ADC10 Conversion Sequence Select 0 */
#define ADC10CONSEQ1_L         (0x0004)       /* ADC10 Conversion Sequence Select 1 */
#define ADC10SSEL0_L           (0x0008)       /* ADC10 Clock Source Select 0 */
#define ADC10SSEL1_L           (0x0010)       /* ADC10 Clock Source Select 1 */
#define ADC10DIV0_L            (0x0020)       /* ADC10 Clock Divider Select 0 */
#define ADC10DIV1_L            (0x0040)       /* ADC10 Clock Divider Select 1 */
#define ADC10DIV2_L            (0x0080)       /* ADC10 Clock Divider Select 2 */

/* ADC10CTL1 Control Bits */
#define ADC10ISSH_H            (0x0001)       /* ADC10 Invert Sample Hold Signal */
#define ADC10SHP_H             (0x0002)       /* ADC10 Sample/Hold Pulse Mode */
#define ADC10SHS0_H            (0x0004)       /* ADC10 Sample/Hold Source 0 */
#define ADC10SHS1_H            (0x0008)       /* ADC10 Sample/Hold Source 1 */

#define ADC10CONSEQ_0          (0*2u)         /* ADC10 Conversion Sequence Select: 0 */
#define ADC10CONSEQ_1          (1*2u)         /* ADC10 Conversion Sequence Select: 1 */
#define ADC10CONSEQ_2          (2*2u)         /* ADC10 Conversion Sequence Select: 2 */
#define ADC10CONSEQ_3          (3*2u)         /* ADC10 Conversion Sequence Select: 3 */

#define ADC10SSEL_0            (0*8u)         /* ADC10 Clock Source Select: 0 */
#define ADC10SSEL_1            (1*8u)         /* ADC10 Clock Source Select: 1 */
#define ADC10SSEL_2            (2*8u)         /* ADC10 Clock Source Select: 2 */
#define ADC10SSEL_3            (3*8u)         /* ADC10 Clock Source Select: 3 */

#define ADC10DIV_0             (0*0x20u)      /* ADC10 Clock Divider Select: 0 */
#define ADC10DIV_1             (1*0x20u)      /* ADC10 Clock Divider Select: 1 */
#define ADC10DIV_2             (2*0x20u)      /* ADC10 Clock Divider Select: 2 */
#define ADC10DIV_3             (3*0x20u)      /* ADC10 Clock Divider Select: 3 */
#define ADC10DIV_4             (4*0x20u)      /* ADC10 Clock Divider Select: 4 */
#define ADC10DIV_5             (5*0x20u)      /* ADC10 Clock Divider Select: 5 */
#define ADC10DIV_6             (6*0x20u)      /* ADC10 Clock Divider Select: 6 */
#define ADC10DIV_7             (7*0x20u)      /* ADC10 Clock Divider Select: 7 */

#define ADC10SHS_0             (0*0x400u)     /* ADC10 Sample/Hold Source: 0 */
#define ADC10SHS_1             (1*0x400u)     /* ADC10 Sample/Hold Source: 1 */
#define ADC10SHS_2             (2*0x400u)     /* ADC10 Sample/Hold Source: 2 */
#define ADC10SHS_3             (3*0x400u)     /* ADC10 Sample/Hold Source: 3 */

/* ADC10CTL2 Control Bits */
#define ADC10REFBURST          (0x0001)       /* ADC10 Reference Burst */
#define ADC10SR                (0x0004)       /* ADC10 Sampling Rate */
#define ADC10DF                (0x0008)       /* ADC10 Data Format */
#define ADC10RES               (0x0010)       /* ADC10 Resolution Bit */
#define ADC10PDIV0             (0x0100)       /* ADC10 predivider Bit: 0 */
#define ADC10PDIV1             (0x0200)       /* ADC10 predivider Bit: 1 */

/* ADC10CTL2 Control Bits */
#define ADC10REFBURST_L        (0x0001)       /* ADC10 Reference Burst */
#define ADC10SR_L              (0x0004)       /* ADC10 Sampling Rate */
#define ADC10DF_L              (0x0008)       /* ADC10 Data Format */
#define ADC10RES_L             (0x0010)       /* ADC10 Resolution Bit */

/* ADC10CTL2 Control Bits */
#define ADC10PDIV0_H           (0x0001)       /* ADC10 predivider Bit: 0 */
#define ADC10PDIV1_H           (0x0002)       /* ADC10 predivider Bit: 1 */

#define ADC10PDIV_0            (0x0000)       /* ADC10 predivider /1 */
#define ADC10PDIV_1            (0x0100)       /* ADC10 predivider /2 */
#define ADC10PDIV_2            (0x0200)       /* ADC10 predivider /64 */
#define ADC10PDIV_3            (0x0300)       /* ADC10 predivider reserved */

#define ADC10PDIV__1           (0x0000)       /* ADC10 predivider /1 */
#define ADC10PDIV__4           (0x0100)       /* ADC10 predivider /2 */
#define ADC10PDIV__64          (0x0200)       /* ADC10 predivider /64 */

