Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
#define ADC12SHT1_0            (0*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 0 */
#define ADC12SHT1_1            (1*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 1 */
#define ADC12SHT1_2            (2*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 2 */
#define ADC12SHT1_3            (3*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 3 */
#define ADC12SHT1_4            (4*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 4 */
#define ADC12SHT1_5            (5*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 5 */
#define ADC12SHT1_6            (6*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 6 */
#define ADC12SHT1_7            (7*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 7 */
#define ADC12SHT1_8            (8*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 8 */
#define ADC12SHT1_9            (9*0x1000u)    /* ADC12 Sample Hold 1 Select Bit: 9 */
#define ADC12SHT1_10           (10*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 10 */
#define ADC12SHT1_11           (11*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 11 */
#define ADC12SHT1_12           (12*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 12 */
#define ADC12SHT1_13           (13*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 13 */
#define ADC12SHT1_14           (14*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 14 */
#define ADC12SHT1_15           (15*0x1000u)   /* ADC12 Sample Hold 1 Select Bit: 15 */

/* ADC12CTL1 Control Bits */
#define ADC12BUSY              (0x0001)       /* ADC12 Busy */
#define ADC12CONSEQ0           (0x0002)       /* ADC12 Conversion Sequence Select Bit: 0 */
#define ADC12CONSEQ1           (0x0004)       /* ADC12 Conversion Sequence Select Bit: 1 */
#define ADC12SSEL0             (0x0008)       /* ADC12 Clock Source Select Bit: 0 */
#define ADC12SSEL1             (0x0010)       /* ADC12 Clock Source Select Bit: 1 */
#define ADC12DIV0              (0x0020)       /* ADC12 Clock Divider Select Bit: 0 */
#define ADC12DIV1              (0x0040)       /* ADC12 Clock Divider Select Bit: 1 */
#define ADC12DIV2              (0x0080)       /* ADC12 Clock Divider Select Bit: 2 */
#define ADC12ISSH              (0x0100)       /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP               (0x0200)       /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0              (0x0400)       /* ADC12 Sample/Hold Source Bit: 0 */
#define ADC12SHS1              (0x0800)       /* ADC12 Sample/Hold Source Bit: 1 */
#define ADC12SHS2              (0x1000)       /* ADC12 Sample/Hold Source Bit: 2 */
#define ADC12PDIV0             (0x2000)       /* ADC12 Predivider Bit: 0 */
#define ADC12PDIV1             (0x4000)       /* ADC12 Predivider Bit: 1 */

/* ADC12CTL1 Control Bits */
#define ADC12BUSY_L            (0x0001)       /* ADC12 Busy */
#define ADC12CONSEQ0_L         (0x0002)       /* ADC12 Conversion Sequence Select Bit: 0 */
#define ADC12CONSEQ1_L         (0x0004)       /* ADC12 Conversion Sequence Select Bit: 1 */
#define ADC12SSEL0_L           (0x0008)       /* ADC12 Clock Source Select Bit: 0 */
#define ADC12SSEL1_L           (0x0010)       /* ADC12 Clock Source Select Bit: 1 */
#define ADC12DIV0_L            (0x0020)       /* ADC12 Clock Divider Select Bit: 0 */
#define ADC12DIV1_L            (0x0040)       /* ADC12 Clock Divider Select Bit: 1 */
#define ADC12DIV2_L            (0x0080)       /* ADC12 Clock Divider Select Bit: 2 */

/* ADC12CTL1 Control Bits */
#define ADC12ISSH_H            (0x0001)       /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP_H             (0x0002)       /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0_H            (0x0004)       /* ADC12 Sample/Hold Source Bit: 0 */
#define ADC12SHS1_H            (0x0008)       /* ADC12 Sample/Hold Source Bit: 1 */
#define ADC12SHS2_H            (0x0010)       /* ADC12 Sample/Hold Source Bit: 2 */
#define ADC12PDIV0_H           (0x0020)       /* ADC12 Predivider Bit: 0 */
#define ADC12PDIV1_H           (0x0040)       /* ADC12 Predivider Bit: 1 */

#define ADC12CONSEQ_0          (0*0x0002u)    /* ADC12 Conversion Sequence Select: 0 */
#define ADC12CONSEQ_1          (1*0x0002u)    /* ADC12 Conversion Sequence Select: 1 */
#define ADC12CONSEQ_2          (2*0x0002u)    /* ADC12 Conversion Sequence Select: 2 */
#define ADC12CONSEQ_3          (3*0x0002u)    /* ADC12 Conversion Sequence Select: 3 */

#define ADC12SSEL_0            (0*0x0008u)    /* ADC12 Clock Source Select: 0 */
#define ADC12SSEL_1            (1*0x0008u)    /* ADC12 Clock Source Select: 1 */
#define ADC12SSEL_2            (2*0x0008u)    /* ADC12 Clock Source Select: 2 */
#define ADC12SSEL_3            (3*0x0008u)    /* ADC12 Clock Source Select: 3 */

#define ADC12DIV_0             (0*0x0020u)    /* ADC12 Clock Divider Select: 0 */
#define ADC12DIV_1             (1*0x0020u)    /* ADC12 Clock Divider Select: 1 */
#define ADC12DIV_2             (2*0x0020u)    /* ADC12 Clock Divider Select: 2 */
#define ADC12DIV_3             (3*0x0020u)    /* ADC12 Clock Divider Select: 3 */
#define ADC12DIV_4             (4*0x0020u)    /* ADC12 Clock Divider Select: 4 */
#define ADC12DIV_5             (5*0x0020u)    /* ADC12 Clock Divider Select: 5 */
#define ADC12DIV_6             (6*0x0020u)    /* ADC12 Clock Divider Select: 6 */
#define ADC12DIV_7             (7*0x0020u)    /* ADC12 Clock Divider Select: 7 */

#define ADC12SHS_0             (0*0x0400u)    /* ADC12 Sample/Hold Source: 0 */
#define ADC12SHS_1             (1*0x0400u)    /* ADC12 Sample/Hold Source: 1 */
#define ADC12SHS_2             (2*0x0400u)    /* ADC12 Sample/Hold Source: 2 */
#define ADC12SHS_3             (3*0x0400u)    /* ADC12 Sample/Hold Source: 3 */
#define ADC12SHS_4             (4*0x0400u)    /* ADC12 Sample/Hold Source: 4 */
#define ADC12SHS_5             (5*0x0400u)    /* ADC12 Sample/Hold Source: 5 */
#define ADC12SHS_6             (6*0x0400u)    /* ADC12 Sample/Hold Source: 6 */
#define ADC12SHS_7             (7*0x0400u)    /* ADC12 Sample/Hold Source: 7 */

#define ADC12PDIV_0            (0*0x2000u)    /* ADC12 Clock predivider Select 0 */
#define ADC12PDIV_1            (1*0x2000u)    /* ADC12 Clock predivider Select 1 */
#define ADC12PDIV_2            (2*0x2000u)    /* ADC12 Clock predivider Select 2 */
#define ADC12PDIV_3            (3*0x2000u)    /* ADC12 Clock predivider Select 3 */
#define ADC12PDIV__1           (0*0x2000u)    /* ADC12 Clock predivider Select: /1 */
#define ADC12PDIV__4           (1*0x2000u)    /* ADC12 Clock predivider Select: /4 */
#define ADC12PDIV__32          (2*0x2000u)    /* ADC12 Clock predivider Select: /32 */
#define ADC12PDIV__64          (3*0x2000u)    /* ADC12 Clock predivider Select: /64 */

