Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
/* Additional Timer B Control Register bits are defined in Timer A */
/* TBxCCTLx Control Bits */
#define CLLD1                  (0x0400)       /* Compare latch load source 1 */
#define CLLD0                  (0x0200)       /* Compare latch load source 0 */

#define SLSHR1                 (0x0400)       /* Compare latch load source 1 */
#define SLSHR0                 (0x0200)       /* Compare latch load source 0 */

#define SLSHR_0                (0*0x0200u)    /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1                (1*0x0200u)    /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2                (2*0x0200u)    /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3                (3*0x0200u)    /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0                 (0*0x0200u)    /* Compare latch load sourec : 0 - immediate */
#define CLLD_1                 (1*0x0200u)    /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2                 (2*0x0200u)    /* Compare latch load sourec : 2 - up/down */
#define CLLD_3                 (3*0x0200u)    /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

/* TBxEX0 Control Bits */
#define TBIDEX0                (0x0001)       /* Timer_B7 Input divider expansion Bit: 0 */
#define TBIDEX1                (0x0002)       /* Timer_B7 Input divider expansion Bit: 1 */
#define TBIDEX2                (0x0004)       /* Timer_B7 Input divider expansion Bit: 2 */

#define TBIDEX_0               (0*0x0001u)    /* Timer_B7 Input divider expansion : /1 */
#define TBIDEX_1               (1*0x0001u)    /* Timer_B7 Input divider expansion : /2 */
#define TBIDEX_2               (2*0x0001u)    /* Timer_B7 Input divider expansion : /3 */
#define TBIDEX_3               (3*0x0001u)    /* Timer_B7 Input divider expansion : /4 */
#define TBIDEX_4               (4*0x0001u)    /* Timer_B7 Input divider expansion : /5 */
#define TBIDEX_5               (5*0x0001u)    /* Timer_B7 Input divider expansion : /6 */
#define TBIDEX_6               (6*0x0001u)    /* Timer_B7 Input divider expansion : /7 */
#define TBIDEX_7               (7*0x0001u)    /* Timer_B7 Input divider expansion : /8 */
#define TBIDEX__1              (0*0x0001u)    /* Timer_B7 Input divider expansion : /1 */
#define TBIDEX__2              (1*0x0001u)    /* Timer_B7 Input divider expansion : /2 */
#define TBIDEX__3              (2*0x0001u)    /* Timer_B7 Input divider expansion : /3 */
#define TBIDEX__4              (3*0x0001u)    /* Timer_B7 Input divider expansion : /4 */
#define TBIDEX__5              (4*0x0001u)    /* Timer_B7 Input divider expansion : /5 */
#define TBIDEX__6              (5*0x0001u)    /* Timer_B7 Input divider expansion : /6 */
#define TBIDEX__7              (6*0x0001u)    /* Timer_B7 Input divider expansion : /7 */
#define TBIDEX__8              (7*0x0001u)    /* Timer_B7 Input divider expansion : /8 */

/********NEW*******/
#define MC_0                   (0*0x10u)      /* Timer A mode control: 0 - Stop */
#define MC_1                   (1*0x10u)      /* Timer A mode control: 1 - Up to CCR0 */
#define MC_2                   (2*0x10u)      /* Timer A mode control: 2 - Continuous up */
#define MC_3                   (3*0x10u)      /* Timer A mode control: 3 - Up/Down */
#define CAP                    (0x0100)       /* Capture mode: 1 /Compare mode : 0 */
#define CCIE                   (0x0010)       /* Capture/compare interrupt enable */
#define CCIFG                  (0x0001)       /* Capture/compare interrupt flag */
#define CCIS_3                 (3*0x1000u)
#define CM_3                   (3*0x4000u)    /* Capture mode: 1 - both edges */
#define OUT                    (0x0004)       /* PWM Output signal if output mode 0 */
#define OUTMOD_7               (7*0x20u)      /* PWM output mode: 7 - PWM reset/set */
#define SCS                    (0x0800)       /* Capture sychronize */
#define CCI                    (0x0008)       /* Capture input signal (read) */
#define ID__1                  (0*0x40u)      /* Timer A input divider: 0 - /1 */
#define ID__2                  (1*0x40u)      /* Timer A input divider: 1 - /2 */
#define ID__4                  (2*0x40u)      /* Timer A input divider: 2 - /4 */
#define ID__8                  (3*0x40u)      /* Timer A input divider: 3 - /8 */
#define ID_0                   (0*0x40u)      /* Timer A input divider: 0 - /1 */
#define ID_1                   (1*0x40u)      /* Timer A input divider: 1 - /2 */
#define ID_2                   (2*0x40u)      /* Timer A input divider: 2 - /4 */
#define ID_3                   (3*0x40u)      /* Timer A input divider: 3 - /8 */


#endif
/************************************************************
* Timerx_D7
************************************************************/
#ifdef  __MSP430_HAS_TxD7__            /* Definition to show that Module is available */

#define OFS_TDxCTL0            (0x0000)       /* Timerx_D7 Control 0 */
#define OFS_TDxCTL1            (0x0002)       /* Timerx_D7 Control 1 */
#define OFS_TDxCTL2            (0x0004)       /* Timerx_D7 Control 2 */
#define OFS_TDxR               (0x0006)       /* Timerx_D7 Counter */
#define OFS_TDxCCTL0           (0x0008)       /* Timerx_D7 Capture/Compare Control 0 */
#define OFS_TDxCCR0            (0x000A)       /* Timerx_D7 Capture/Compare 0 */
#define OFS_TDxCL0             (0x000C)       /* Timerx_D7 Capture/Compare Latch 0 */
#define OFS_TDxCCTL1           (0x000E)       /* Timerx_D7 Capture/Compare Control 1 */
#define OFS_TDxCCR1            (0x0010)       /* Timerx_D7 Capture/Compare 1 */
#define OFS_TDxCL1             (0x0012)       /* Timerx_D7 Capture/Compare Latch 1 */
#define OFS_TDxCCTL2           (0x0014)       /* Timerx_D7 Capture/Compare Control 2 */
#define OFS_TDxCCR2            (0x0016)       /* Timerx_D7 Capture/Compare 2 */
#define OFS_TDxCL2             (0x0018)       /* Timerx_D7 Capture/Compare Latch 2 */
#define OFS_TDxCCTL3           (0x001A)       /* Timerx_D7 Capture/Compare Control 3 */
#define OFS_TDxCCR3            (0x001C)       /* Timerx_D7 Capture/Compare 3 */
#define OFS_TDxCL3             (0x001E)       /* Timerx_D7 Capture/Compare Latch 3 */
#define OFS_TDxCCTL4           (0x0020)       /* Timerx_D7 Capture/Compare Control 4 */
#define OFS_TDxCCR4            (0x0022)       /* Timerx_D7 Capture/Compare 4 */
#define OFS_TDxCL4             (0x0024)       /* Timerx_D7 Capture/Compare Latch 4 */
#define OFS_TDxCCTL5           (0x0026)       /* Timerx_D7 Capture/Compare Control 5 */
#define OFS_TDxCCR5            (0x0028)       /* Timerx_D7 Capture/Compare 5 */
#define OFS_TDxCL5             (0x002A)       /* Timerx_D7 Capture/Compare Latch 5 */
#define OFS_TDxCCTL6           (0x002C)       /* Timerx_D7 Capture/Compare Control 6 */
#define OFS_TDxCCR6            (0x002E)       /* Timerx_D7 Capture/Compare 6 */
#define OFS_TDxCL6             (0x0030)       /* Timerx_D7 Capture/Compare Latch 6 */
#define OFS_TDxHCTL0           (0x0038)       /* Timerx_D7 High-resolution Control Register 0 */
#define OFS_TDxHCTL1           (0x003A)       /* Timerx_D7 High-resolution Control Register 1 */
#define OFS_TDxHINT            (0x003C)       /* Timerx_D7 High-resolution Interrupt Register */
#define OFS_TDxIV              (0x003E)       /* Timerx_D7 Interrupt Vector Word */

/* Bits are already defined within the Timer0_Dx */

/* TDxIV Definitions */
#define TDxIV_NONE             (0x0000)       /* No Interrupt pending */
#define TDxIV_TDxCCR1          (0x0002)       /* TDxCCR1_CCIFG */
#define TDxIV_TDxCCR2          (0x0004)       /* TDxCCR2_CCIFG */
#define TDxIV_TDxCCR3          (0x0006)       /* TDxCCR3_CCIFG */
#define TDxIV_TDxCCR4          (0x0008)       /* TDxCCR4_CCIFG */
#define TDxIV_TDxCCR5          (0x000A)       /* TDxCCR5_CCIFG */
#define TDxIV_TDxCCR6          (0x000C)       /* TDxCCR6_CCIFG */
#define TDxIV_RES_14           (0x000E)       /* Reserverd */
#define TDxIV_TDxIFG           (0x0010)       /* TDxIFG */
#define TDxIV_TDHFLIFG         (0x0012)       /* TDHFLIFG Clock fail low */
#define TDxIV_TDHFHIFG         (0x0014)       /* TDHFLIFG Clock fail high */
#define TDxIV_TDHLKIFG         (0x0016)       /* TDHLKIE Clock lock*/
#define TDxIV_TDHUNLKIFG       (0x0018)       /* TDHUNLKIE Clock unlock */

/* TDxCTL0 Control Bits */
#define TDCLGRP1               (0x4000)       /* Timer_D7 Compare latch load group 1 */
#define TDCLGRP0               (0x2000)       /* Timer_D7 Compare latch load group 0 */
#define CNTL1                  (0x1000)       /* Counter lenght 1 */
#define CNTL0                  (0x0800)       /* Counter lenght 0 */
#define TDSSEL1                (0x0200)       /* Clock source 1 */
#define TDSSEL0                (0x0100)       /* Clock source 0 */
#define TDCLR                  (0x0004)       /* Timer_D7 counter clear */
#define TDIE                   (0x0002)       /* Timer_D7 interrupt enable */
#define TDIFG                  (0x0001)       /* Timer_D7 interrupt flag */

