Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
#define SHR1                   (0x4000)       /* Timer_D7 Compare latch load group 1 */
#define SHR0                   (0x2000)       /* Timer_D7 Compare latch load group 0 */

#define TDSSEL_0               (0*0x0100u)    /* Clock Source: TDCLK */
#define TDSSEL_1               (1*0x0100u)    /* Clock Source: ACLK  */
#define TDSSEL_2               (2*0x0100u)    /* Clock Source: SMCLK */
#define TDSSEL_3               (3*0x0100u)    /* Clock Source: INCLK */
#define CNTL_0                 (0*0x0800u)    /* Counter lenght: 16 bit */
#define CNTL_1                 (1*0x0800u)    /* Counter lenght: 12 bit */
#define CNTL_2                 (2*0x0800u)    /* Counter lenght: 10 bit */
#define CNTL_3                 (3*0x0800u)    /* Counter lenght:  8 bit */
#define SHR_0                  (0*0x2000u)    /* Timer_D7 Group: 0 - individually */
#define SHR_1                  (1*0x2000u)    /* Timer_D7 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2                  (2*0x2000u)    /* Timer_D7 Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3                  (3*0x2000u)    /* Timer_D7 Group: 3 - 1 group (all) */
#define TDCLGRP_0              (0*0x2000u)    /* Timer_D7 Group: 0 - individually */
#define TDCLGRP_1              (1*0x2000u)    /* Timer_D7 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TDCLGRP_2              (2*0x2000u)    /* Timer_D7 Group: 2 - 2 groups (1-3, 4-6)*/
#define TDCLGRP_3              (3*0x2000u)    /* Timer_D7 Group: 3 - 1 group (all) */
#define TDSSEL__TACLK          (0*0x0100u)    /* Timer_D7 clock source select: 0 - TACLK */
#define TDSSEL__ACLK           (1*0x0100u)    /* Timer_D7 clock source select: 1 - ACLK  */
#define TDSSEL__SMCLK          (2*0x0100u)    /* Timer_D7 clock source select: 2 - SMCLK */
#define TDSSEL__INCLK          (3*0x0100u)    /* Timer_D7 clock source select: 3 - INCLK */
#define CNTL__16               (0*0x0800u)    /* Counter lenght: 16 bit */
#define CNTL__12               (1*0x0800u)    /* Counter lenght: 12 bit */
#define CNTL__10               (2*0x0800u)    /* Counter lenght: 10 bit */
#define CNTL__8                (3*0x0800u)    /* Counter lenght:  8 bit */

/* Additional Timer B Control Register bits are defined in Timer A */

/* TDxCTL1 Control Bits */
#define TDCLKM0                (0x0001)       /* Timer_D7 Clocking Mode Bit: 0 */
#define TDCLKM1                (0x0002)       /* Timer_D7 Clocking Mode Bit: 1 */
#define TD2CMB                 (0x0010)       /* Timer_D7 TD0CCR Combination in TD2 */
#define TD4CMB                 (0x0020)       /* Timer_D7 TD0CCR Combination in TD4 */
#define TD6CMB                 (0x0040)       /* Timer_D7 TD0CCR Combination in TD6 */
#define TDIDEX0                (0x0100)       /* Timer_D7 Input divider expansion Bit: 0 */
#define TDIDEX1                (0x0200)       /* Timer_D7 Input divider expansion Bit: 1 */
#define TDIDEX2                (0x0400)       /* Timer_D7 Input divider expansion Bit: 2 */

#define TDCLKM_0               (0x0000)       /* Timer_D7 Clocking Mode: External */
#define TDCLKM_1               (0x0001)       /* Timer_D7 Clocking Mode: High-Res. local clock */
#define TDCLKM_2               (0x0002)       /* Timer_D7 Clocking Mode: Aux Clock */
#define TDCLKM__EXT            (0x0000)       /* Timer_D7 Clocking Mode: External */
#define TDCLKM__HIGHRES        (0x0001)       /* Timer_D7 Clocking Mode: High-Res. local clock */
#define TDCLKM__AUX            (0x0002)       /* Timer_D7 Clocking Mode: Aux Clock */

#define TDIDEX_0               (0*0x0001u)    /* Timer_D7 Input divider expansion : /1 */
#define TDIDEX_1               (1*0x0001u)    /* Timer_D7 Input divider expansion : /2 */
#define TDIDEX_2               (2*0x0001u)    /* Timer_D7 Input divider expansion : /3 */
#define TDIDEX_3               (3*0x0001u)    /* Timer_D7 Input divider expansion : /4 */
#define TDIDEX_4               (4*0x0001u)    /* Timer_D7 Input divider expansion : /5 */
#define TDIDEX_5               (5*0x0001u)    /* Timer_D7 Input divider expansion : /6 */
#define TDIDEX_6               (6*0x0001u)    /* Timer_D7 Input divider expansion : /7 */
#define TDIDEX_7               (7*0x0001u)    /* Timer_D7 Input divider expansion : /8 */
#define TDIDEX__1              (0*0x0001u)    /* Timer_D7 Input divider expansion : /1 */
#define TDIDEX__2              (1*0x0001u)    /* Timer_D7 Input divider expansion : /2 */
#define TDIDEX__3              (2*0x0001u)    /* Timer_D7 Input divider expansion : /3 */
#define TDIDEX__4              (3*0x0001u)    /* Timer_D7 Input divider expansion : /4 */
#define TDIDEX__5              (4*0x0001u)    /* Timer_D7 Input divider expansion : /5 */
#define TDIDEX__6              (5*0x0001u)    /* Timer_D7 Input divider expansion : /6 */
#define TDIDEX__7              (6*0x0001u)    /* Timer_D7 Input divider expansion : /7 */
#define TDIDEX__8              (7*0x0001u)    /* Timer_D7 Input divider expansion : /8 */

/* TDxCTL2 Control Bits */
#define TDCAPM0                (0x0001)       /* Timer_D7 Capture Mode of Channel 0 */
#define TDCAPM1                (0x0002)       /* Timer_D7 Capture Mode of Channel 1 */
#define TDCAPM2                (0x0004)       /* Timer_D7 Capture Mode of Channel 2 */
#define TDCAPM3                (0x0008)       /* Timer_D7 Capture Mode of Channel 3 */
#define TDCAPM4                (0x0010)       /* Timer_D7 Capture Mode of Channel 4 */
#define TDCAPM5                (0x0020)       /* Timer_D7 Capture Mode of Channel 5 */
#define TDCAPM6                (0x0040)       /* Timer_D7 Capture Mode of Channel 6 */

/* TDxCCTLx Control Bits */
#define CLLD1                  (0x0400)       /* Compare latch load source 1 */
#define CLLD0                  (0x0200)       /* Compare latch load source 0 */

#define SLSHR1                 (0x0400)       /* Compare latch load source 1 */
#define SLSHR0                 (0x0200)       /* Compare latch load source 0 */

#define SLSHR_0                (0*0x0200u)    /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1                (1*0x0200u)    /* Compare latch load sourec : 1 - TDR counts to 0 */
#define SLSHR_2                (2*0x0200u)    /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3                (3*0x0200u)    /* Compare latch load sourec : 3 - TDR counts to TDCTL0 */

#define CLLD_0                 (0*0x0200u)    /* Compare latch load sourec : 0 - immediate */
#define CLLD_1                 (1*0x0200u)    /* Compare latch load sourec : 1 - TDR counts to 0 */
#define CLLD_2                 (2*0x0200u)    /* Compare latch load sourec : 2 - up/down */
#define CLLD_3                 (3*0x0200u)    /* Compare latch load sourec : 3 - TDR counts to TDCTL0 */

