Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
//values of USBVECINT when USB-interrupt occured
#define     USBVECINT_NONE     0x00
#define     USBVECINT_PWR_DROP 0x02
#define     USBVECINT_PLL_LOCK 0x04
#define     USBVECINT_PLL_SIGNAL 0x06
#define     USBVECINT_PLL_RANGE 0x08
#define     USBVECINT_PWR_VBUSOn 0x0A
#define     USBVECINT_PWR_VBUSOff 0x0C
#define     USBVECINT_USB_TIMESTAMP 0x10
#define     USBVECINT_INPUT_ENDPOINT0 0x12
#define     USBVECINT_OUTPUT_ENDPOINT0 0x14
#define     USBVECINT_RSTR     0x16
#define     USBVECINT_SUSR     0x18
#define     USBVECINT_RESR     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED 0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED 0x22
#define     USBVECINT_INPUT_ENDPOINT1 0x24
#define     USBVECINT_INPUT_ENDPOINT2 0x26
#define     USBVECINT_INPUT_ENDPOINT3 0x28
#define     USBVECINT_INPUT_ENDPOINT4 0x2A
#define     USBVECINT_INPUT_ENDPOINT5 0x2C
#define     USBVECINT_INPUT_ENDPOINT6 0x2E
#define     USBVECINT_INPUT_ENDPOINT7 0x30
#define     USBVECINT_OUTPUT_ENDPOINT1 0x32
#define     USBVECINT_OUTPUT_ENDPOINT2 0x34
#define     USBVECINT_OUTPUT_ENDPOINT3 0x36
#define     USBVECINT_OUTPUT_ENDPOINT4 0x38
#define     USBVECINT_OUTPUT_ENDPOINT5 0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6 0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7 0x3E


/* ========================================================================= */
/* USB Operation Registers */
/* ========================================================================= */

#define OFS_USBIEPSIZXY_7      (0x23FF)       /* Input Endpoint_7: X/Y-buffer size  */
#define OFS_USBIEPBCTY_7       (0x23FE)       /* Input Endpoint_7: Y-byte count  */
#define OFS_USBIEPBBAY_7       (0x23FD)       /* Input Endpoint_7: Y-buffer base addr.  */
//#define    Spare_O    (0x23FC)   /* Not used  */
//#define    Spare_O    (0x23FB)   /* Not used  */
#define OFS_USBIEPBCTX_7       (0x23FA)       /* Input Endpoint_7: X-byte count  */
#define OFS_USBIEPBBAX_7       (0x23F9)       /* Input Endpoint_7: X-buffer base addr. */
#define OFS_USBIEPCNF_7        (0x23F8)       /* Input Endpoint_7: Configuration  */
#define OFS_USBIEPSIZXY_6      (0x23F7)       /* Input Endpoint_6: X/Y-buffer size  */
#define OFS_USBIEPBCTY_6       (0x23F6)       /* Input Endpoint_6: Y-byte count */
#define OFS_USBIEPBBAY_6       (0x23F5)       /* Input Endpoint_6: Y-buffer base addr. */
//#define    Spare_O    (0x23F4)   /* Not used  */
//#define    Spare_O    (0x23F3)   /* Not used  */
#define OFS_USBIEPBCTX_6       (0x23F2)       /* Input Endpoint_6: X-byte count */
#define OFS_USBIEPBBAX_6       (0x23F1)       /* Input Endpoint_6: X-buffer base addr. */
#define OFS_USBIEPCNF_6        (0x23F0)       /* Input Endpoint_6: Configuration */
#define OFS_USBIEPSIZXY_5      (0x23EF)       /* Input Endpoint_5: X/Y-buffer size */
#define OFS_USBIEPBCTY_5       (0x23EE)       /* Input Endpoint_5: Y-byte count */
#define OFS_USBIEPBBAY_5       (0x23ED)       /* Input Endpoint_5: Y-buffer base addr. */
//#define    Spare_O    (0x23EC)   /* Not used */
//#define    Spare_O    (0x23EB)   /* Not used */
#define OFS_USBIEPBCTX_5       (0x23EA)       /* Input Endpoint_5: X-byte count */
#define OFS_USBIEPBBAX_5       (0x23E9)       /* Input Endpoint_5: X-buffer base addr. */
#define OFS_USBIEPCNF_5        (0x23E8)       /* Input Endpoint_5: Configuration */
#define OFS_USBIEPSIZXY_4      (0x23E7)       /* Input Endpoint_4: X/Y-buffer size */
#define OFS_USBIEPBCTY_4       (0x23E6)       /* Input Endpoint_4: Y-byte count */
#define OFS_USBIEPBBAY_4       (0x23E5)       /* Input Endpoint_4: Y-buffer base addr. */
//#define    Spare_O    (0x23E4)   /* Not used */
//#define    Spare_O    (0x23E3)   /* Not used */
#define OFS_USBIEPBCTX_4       (0x23E2)       /* Input Endpoint_4: X-byte count */
#define OFS_USBIEPBBAX_4       (0x23E1)       /* Input Endpoint_4: X-buffer base addr. */
#define OFS_USBIEPCNF_4        (0x23E0)       /* Input Endpoint_4: Configuration */
#define OFS_USBIEPSIZXY_3      (0x23DF)       /* Input Endpoint_3: X/Y-buffer size */
#define OFS_USBIEPBCTY_3       (0x23DE)       /* Input Endpoint_3: Y-byte count */
#define OFS_USBIEPBBAY_3       (0x23DD)       /* Input Endpoint_3: Y-buffer base addr. */
//#define    Spare_O    (0x23DC)   /* Not used */
//#define    Spare_O    (0x23DB)   /* Not used */
#define OFS_USBIEPBCTX_3       (0x23DA)       /* Input Endpoint_3: X-byte count */
#define OFS_USBIEPBBAX_3       (0x23D9)       /* Input Endpoint_3: X-buffer base addr. */
#define OFS_USBIEPCNF_3        (0x23D8)       /* Input Endpoint_3: Configuration */
#define OFS_USBIEPSIZXY_2      (0x23D7)       /* Input Endpoint_2: X/Y-buffer size */
#define OFS_USBIEPBCTY_2       (0x23D6)       /* Input Endpoint_2: Y-byte count */
#define OFS_USBIEPBBAY_2       (0x23D5)       /* Input Endpoint_2: Y-buffer base addr. */
//#define    Spare_O    (0x23D4)   /* Not used */
//#define    Spare_O    (0x23D3)   /* Not used */
#define OFS_USBIEPBCTX_2       (0x23D2)       /* Input Endpoint_2: X-byte count */
#define OFS_USBIEPBBAX_2       (0x23D1)       /* Input Endpoint_2: X-buffer base addr. */
#define OFS_USBIEPCNF_2        (0x23D0)       /* Input Endpoint_2: Configuration */
#define OFS_USBIEPSIZXY_1      (0x23CF)       /* Input Endpoint_1: X/Y-buffer size */
#define OFS_USBIEPBCTY_1       (0x23CE)       /* Input Endpoint_1: Y-byte count */
#define OFS_USBIEPBBAY_1       (0x23CD)       /* Input Endpoint_1: Y-buffer base addr. */
//#define    Spare_O    (0x23CC)   /* Not used */
//#define    Spare_O    (0x23CB)   /* Not used */
#define OFS_USBIEPBCTX_1       (0x23CA)       /* Input Endpoint_1: X-byte count */
#define OFS_USBIEPBBAX_1       (0x23C9)       /* Input Endpoint_1: X-buffer base addr. */
#define OFS_USBIEPCNF_1        (0x23C8)       /* Input Endpoint_1: Configuration */
//#define       (0x23C7)_O   /* */
//#define     RESERVED_O      (0x1C00)    /* */
//#define       (0x23C0)_O   /* */
#define OFS_USBOEPSIZXY_7      (0x23BF)       /* Output Endpoint_7: X/Y-buffer size */
#define OFS_USBOEPBCTY_7       (0x23BE)       /* Output Endpoint_7: Y-byte count */
#define OFS_USBOEPBBAY_7       (0x23BD)       /* Output Endpoint_7: Y-buffer base addr. */
//#define    Spare_O    (0x23BC)   /* Not used */
//#define    Spare_O    (0x23BB)   /* Not used */
#define OFS_USBOEPBCTX_7       (0x23BA)       /* Output Endpoint_7: X-byte count */
#define OFS_USBOEPBBAX_7       (0x23B9)       /* Output Endpoint_7: X-buffer base addr. */
#define OFS_USBOEPCNF_7        (0x23B8)       /* Output Endpoint_7: Configuration */
#define OFS_USBOEPSIZXY_6      (0x23B7)       /* Output Endpoint_6: X/Y-buffer size */
#define OFS_USBOEPBCTY_6       (0x23B6)       /* Output Endpoint_6: Y-byte count */
#define OFS_USBOEPBBAY_6       (0x23B5)       /* Output Endpoint_6: Y-buffer base addr. */
//#define    Spare_O    (0x23B4)   /* Not used */
//#define    Spare_O    (0x23B3)   /* Not used */
#define OFS_USBOEPBCTX_6       (0x23B2)       /* Output Endpoint_6: X-byte count */
#define OFS_USBOEPBBAX_6       (0x23B1)       /* Output Endpoint_6: X-buffer base addr. */
#define OFS_USBOEPCNF_6        (0x23B0)       /* Output Endpoint_6: Configuration */
#define OFS_USBOEPSIZXY_5      (0x23AF)       /* Output Endpoint_5: X/Y-buffer size */
#define OFS_USBOEPBCTY_5       (0x23AE)       /* Output Endpoint_5: Y-byte count */
#define OFS_USBOEPBBAY_5       (0x23AD)       /* Output Endpoint_5: Y-buffer base addr. */
//#define    Spare_O    (0x23AC)   /* Not used */
//#define    Spare_O    (0x23AB)   /* Not used */
#define OFS_USBOEPBCTX_5       (0x23AA)       /* Output Endpoint_5: X-byte count */
#define OFS_USBOEPBBAX_5       (0x23A9)       /* Output Endpoint_5: X-buffer base addr. */
#define OFS_USBOEPCNF_5        (0x23A8)       /* Output Endpoint_5: Configuration */
#define OFS_USBOEPSIZXY_4      (0x23A7)       /* Output Endpoint_4: X/Y-buffer size */
#define OFS_USBOEPBCTY_4       (0x23A6)       /* Output Endpoint_4: Y-byte count */
#define OFS_USBOEPBBAY_4       (0x23A5)       /* Output Endpoint_4: Y-buffer base addr. */
//#define    Spare_O    (0x23A4)   /* Not used */
//#define    Spare_O    (0x23A3)   /* Not used */
#define OFS_USBOEPBCTX_4       (0x23A2)       /* Output Endpoint_4: X-byte count */
#define OFS_USBOEPBBAX_4       (0x23A1)       /* Output Endpoint_4: X-buffer base addr. */
#define OFS_USBOEPCNF_4        (0x23A0)       /* Output Endpoint_4: Configuration */
#define OFS_USBOEPSIZXY_3      (0x239F)       /* Output Endpoint_3: X/Y-buffer size */
#define OFS_USBOEPBCTY_3       (0x239E)       /* Output Endpoint_3: Y-byte count */
#define OFS_USBOEPBBAY_3       (0x239D)       /* Output Endpoint_3: Y-buffer base addr. */
//#define    Spare_O    (0x239C)   /* Not used */
//#define    Spare_O    (0x239B)   /* Not used */
#define OFS_USBOEPBCTX_3       (0x239A)       /* Output Endpoint_3: X-byte count */
#define OFS_USBOEPBBAX_3       (0x2399)       /* Output Endpoint_3: X-buffer base addr. */
#define OFS_USBOEPCNF_3        (0x2398)       /* Output Endpoint_3: Configuration */
#define OFS_USBOEPSIZXY_2      (0x2397)       /* Output Endpoint_2: X/Y-buffer size */
#define OFS_USBOEPBCTY_2       (0x2396)       /* Output Endpoint_2: Y-byte count */
#define OFS_USBOEPBBAY_2       (0x2395)       /* Output Endpoint_2: Y-buffer base addr. */
//#define    Spare_O    (0x2394)   /* Not used */
//#define    Spare_O    (0x2393)   /* Not used */
#define OFS_USBOEPBCTX_2       (0x2392)       /* Output Endpoint_2: X-byte count */
#define OFS_USBOEPBBAX_2       (0x2391)       /* Output Endpoint_2: X-buffer base addr. */
#define OFS_USBOEPCNF_2        (0x2390)       /* Output Endpoint_2: Configuration */
#define OFS_USBOEPSIZXY_1      (0x238F)       /* Output Endpoint_1: X/Y-buffer size */
#define OFS_USBOEPBCTY_1       (0x238E)       /* Output Endpoint_1: Y-byte count */
#define OFS_USBOEPBBAY_1       (0x238D)       /* Output Endpoint_1: Y-buffer base addr. */
//#define    Spare_O    (0x238C)   /* Not used */
//#define    Spare_O    (0x238B)   /* Not used */
#define OFS_USBOEPBCTX_1       (0x238A)       /* Output Endpoint_1: X-byte count */
#define OFS_USBOEPBBAX_1       (0x2389)       /* Output Endpoint_1: X-buffer base addr. */
#define OFS_USBOEPCNF_1        (0x2388)       /* Output Endpoint_1: Configuration */
#define OFS_USBSUBLK           (0x2380)       /* Setup Packet Block */
#define OFS_USBIEP0BUF         (0x2378)       /* Input endpoint_0 buffer */
#define OFS_USBOEP0BUF         (0x2370)       /* Output endpoint_0 buffer */
#define OFS_USBTOPBUFF         (0x236F)       /* Top of buffer space */
//         (1904 Bytes)               /* Buffer space */
#define OFS_USBSTABUFF         (0x1C00)       /* Start of buffer space */

/* USBIEPCNF_n Control Bits */
/* USBOEPCNF_n Control Bits */
//#define RESERVED       (0x0001)  /* USB -  */
//#define RESERVED       (0x0001)  /* USB -  */
#define DBUF                   (0x0010)       /* USB - Double Buffer Enable */
//#define RESERVED       (0x0040)  /* USB -  */

/* USBIEPBCNT_n Control Bits */
/* USBOEPBCNT_n Control Bits */
#define CNT4                   (0x0010)       /* USB - Byte Count Bit 3 */
#define CNT5                   (0x0020)       /* USB - Byte Count Bit 3 */
#define CNT6                   (0x0040)       /* USB - Byte Count Bit 3 */
#endif
/************************************************************
* USCI Ax
************************************************************/
#ifdef  __MSP430_HAS_USCI_Ax__       /* Definition to show that Module is available */

#define OFS_UCAxCTLW0          (0x0000)       /* USCI Ax Control Word Register 0 */
#define OFS_UCAxCTLW0_L        OFS_UCAxCTLW0
#define OFS_UCAxCTLW0_H        OFS_UCAxCTLW0+1
#define OFS_UCAxCTL0           (0x0001)
#define OFS_UCAxCTL1           (0x0000)
#define UCAxCTL1               UCAxCTLW0_L    /* USCI Ax Control Register 1 */
#define UCAxCTL0               UCAxCTLW0_H    /* USCI Ax Control Register 0 */
#define OFS_UCAxBRW            (0x0006)       /* USCI Ax Baud Word Rate 0 */
#define OFS_UCAxBRW_L          OFS_UCAxBRW
#define OFS_UCAxBRW_H          OFS_UCAxBRW+1
#define OFS_UCAxBR0            (0x0006)
#define OFS_UCAxBR1            (0x0007)
#define UCAxBR0                UCAxBRW_L      /* USCI Ax Baud Rate 0 */
#define UCAxBR1                UCAxBRW_H      /* USCI Ax Baud Rate 1 */
#define OFS_UCAxMCTL           (0x0008)       /* USCI Ax Modulation Control */
#define OFS_UCAxSTAT           (0x000A)       /* USCI Ax Status Register */
#define OFS_UCAxRXBUF          (0x000C)       /* USCI Ax Receive Buffer */
#define OFS_UCAxTXBUF          (0x000E)       /* USCI Ax Transmit Buffer */
#define OFS_UCAxABCTL          (0x0010)       /* USCI Ax LIN Control */
#define OFS_UCAxIRCTL          (0x0012)       /* USCI Ax IrDA Transmit Control */
#define OFS_UCAxIRCTL_L        OFS_UCAxIRCTL
#define OFS_UCAxIRCTL_H        OFS_UCAxIRCTL+1
#define OFS_UCAxIRTCTL         (0x0012)
#define OFS_UCAxIRRCTL         (0x0013)
#define UCAxIRTCTL             UCAxIRCTL_L    /* USCI Ax IrDA Transmit Control */
#define UCAxIRRCTL             UCAxIRCTL_H    /* USCI Ax IrDA Receive Control */
#define OFS_UCAxICTL           (0x001C)       /* USCI Ax Interrupt Enable Register */
#define OFS_UCAxICTL_L         OFS_UCAxICTL
#define OFS_UCAxICTL_H         OFS_UCAxICTL+1
#define OFS_UCAxIE             (0x001C)
#define OFS_UCAxIFG            (0x001D)
#define UCAxIE                 UCAxICTL_L     /* USCI Ax Interrupt Enable Register */
#define UCAxIFG                UCAxICTL_H     /* USCI Ax Interrupt Flags Register */
#define OFS_UCAxIV             (0x001E)       /* USCI Ax Interrupt Vector Register */

#define OFS_UCAxCTLW0__SPI     (0x0000)
#define OFS_UCAxCTLW0__SPI_L   OFS_UCAxCTLW0__SPI
#define OFS_UCAxCTLW0__SPI_H   OFS_UCAxCTLW0__SPI+1
#define OFS_UCAxCTL0__SPI      (0x0001)
#define OFS_UCAxCTL1__SPI      (0x0000)
#define OFS_UCAxBRW__SPI       (0x0006)
#define OFS_UCAxBRW__SPI_L     OFS_UCAxBRW__SPI
#define OFS_UCAxBRW__SPI_H     OFS_UCAxBRW__SPI+1
#define OFS_UCAxBR0__SPI       (0x0006)
#define OFS_UCAxBR1__SPI       (0x0007)
#define OFS_UCAxMCTL__SPI      (0x0008)
#define OFS_UCAxSTAT__SPI      (0x000A)
#define OFS_UCAxRXBUF__SPI     (0x000C)
#define OFS_UCAxTXBUF__SPI     (0x000E)
#define OFS_UCAxICTL__SPI      (0x001C)
#define OFS_UCAxICTL__SPI_L    OFS_UCAxICTL__SPI
#define OFS_UCAxICTL__SPI_H    OFS_UCAxICTL__SPI+1
#define OFS_UCAxIE__SPI        (0x001C)
#define OFS_UCAxIFG__SPI       (0x001D)
#define OFS_UCAxIV__SPI        (0x001E)

#endif
/************************************************************
* USCI Bx
************************************************************/
#ifdef  __MSP430_HAS_USCI_Bx__        /* Definition to show that Module is available */

#define OFS_UCBxCTLW0__SPI     (0x0000)
#define OFS_UCBxCTLW0__SPI_L   OFS_UCBxCTLW0__SPI
#define OFS_UCBxCTLW0__SPI_H   OFS_UCBxCTLW0__SPI+1
#define OFS_UCBxCTL0__SPI      (0x0001)
#define OFS_UCBxCTL1__SPI      (0x0000)
#define OFS_UCBxBRW__SPI       (0x0006)
#define OFS_UCBxBRW__SPI_L     OFS_UCBxBRW__SPI
#define OFS_UCBxBRW__SPI_H     OFS_UCBxBRW__SPI+1
#define OFS_UCBxBR0__SPI       (0x0006)
#define OFS_UCBxBR1__SPI       (0x0007)
#define OFS_UCBxSTAT__SPI      (0x000A)
#define OFS_UCBxRXBUF__SPI     (0x000C)
#define OFS_UCBxTXBUF__SPI     (0x000E)
#define OFS_UCBxICTL__SPI      (0x001C)
#define OFS_UCBxICTL__SPI_L    OFS_UCBxICTL__SPI
#define OFS_UCBxICTL__SPI_H    OFS_UCBxICTL__SPI+1
#define OFS_UCBxIE__SPI        (0x001C)
#define OFS_UCBxIFG__SPI       (0x001D)
#define OFS_UCBxIV__SPI        (0x001E)

#define OFS_UCBxCTLW0          (0x0000)       /* USCI Bx Control Word Register 0 */
#define OFS_UCBxCTLW0_L        OFS_UCBxCTLW0
#define OFS_UCBxCTLW0_H        OFS_UCBxCTLW0+1
#define OFS_UCBxCTL0           (0x0001)
#define OFS_UCBxCTL1           (0x0000)
#define UCBxCTL1               UCBxCTLW0_L    /* USCI Bx Control Register 1 */
#define UCBxCTL0               UCBxCTLW0_H    /* USCI Bx Control Register 0 */
#define OFS_UCBxBRW            (0x0006)       /* USCI Bx Baud Word Rate 0 */
#define OFS_UCBxBRW_L          OFS_UCBxBRW
#define OFS_UCBxBRW_H          OFS_UCBxBRW+1
#define OFS_UCBxBR0            (0x0006)
#define OFS_UCBxBR1            (0x0007)
#define UCBxBR0                UCBxBRW_L      /* USCI Bx Baud Rate 0 */
#define UCBxBR1                UCBxBRW_H      /* USCI Bx Baud Rate 1 */
#define OFS_UCBxSTAT           (0x000A)       /* USCI Bx Status Register */
#define OFS_UCBxRXBUF          (0x000C)       /* USCI Bx Receive Buffer */
#define OFS_UCBxTXBUF          (0x000E)       /* USCI Bx Transmit Buffer */
#define OFS_UCBxI2COA          (0x0010)       /* USCI Bx I2C Own Address */
#define OFS_UCBxI2COA_L        OFS_UCBxI2COA
#define OFS_UCBxI2COA_H        OFS_UCBxI2COA+1
#define OFS_UCBxI2CSA          (0x0012)       /* USCI Bx I2C Slave Address */
#define OFS_UCBxI2CSA_L        OFS_UCBxI2CSA
#define OFS_UCBxI2CSA_H        OFS_UCBxI2CSA+1
#define OFS_UCBxICTL           (0x001C)       /* USCI Bx Interrupt Enable Register */
#define OFS_UCBxICTL_L         OFS_UCBxICTL
#define OFS_UCBxICTL_H         OFS_UCBxICTL+1
#define OFS_UCBxIE             (0x001C)
#define OFS_UCBxIFG            (0x001D)
#define UCBxIE                 UCBxICTL_L     /* USCI Bx Interrupt Enable Register */
#define UCBxIFG                UCBxICTL_H     /* USCI Bx Interrupt Flags Register */
#define OFS_UCBxIV             (0x001E)       /* USCI Bx Interrupt Vector Register */

#endif
#if (defined(__MSP430_HAS_USCI_Ax__) || defined(__MSP430_HAS_USCI_Bx__))

// UCAxCTL0 UART-Mode Control Bits
#define UCPEN                  (0x80)         /* Async. Mode: Parity enable */
#define UCPAR                  (0x40)         /* Async. Mode: Parity     0:odd / 1:even */
#define UCMSB                  (0x20)         /* Async. Mode: MSB first  0:LSB / 1:MSB */
#define UC7BIT                 (0x10)         /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
#define UCSPB                  (0x08)         /* Async. Mode: Stop Bits  0:one / 1: two */
#define UCMODE1                (0x04)         /* Async. Mode: USCI Mode 1 */
#define UCMODE0                (0x02)         /* Async. Mode: USCI Mode 0 */
#define UCSYNC                 (0x01)         /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */

// UCxxCTL0 SPI-Mode Control Bits
#define UCCKPH                 (0x80)         /* Sync. Mode: Clock Phase */
#define UCCKPL                 (0x40)         /* Sync. Mode: Clock Polarity */
#define UCMST                  (0x08)         /* Sync. Mode: Master Select */

// UCBxCTL0 I2C-Mode Control Bits
#define UCA10                  (0x80)         /* 10-bit Address Mode */
#define UCSLA10                (0x40)         /* 10-bit Slave Address Mode */
#define UCMM                   (0x20)         /* Multi-Master Environment */
//#define res               (0x10)    /* reserved */
#define UCMODE_0               (0x00)         /* Sync. Mode: USCI Mode: 0 */
#define UCMODE_1               (0x02)         /* Sync. Mode: USCI Mode: 1 */
#define UCMODE_2               (0x04)         /* Sync. Mode: USCI Mode: 2 */
#define UCMODE_3               (0x06)         /* Sync. Mode: USCI Mode: 3 */

// UCAxCTL1 UART-Mode Control Bits
#define UCSSEL1                (0x80)         /* USCI 0 Clock Source Select 1 */
#define UCSSEL0                (0x40)         /* USCI 0 Clock Source Select 0 */
#define UCRXEIE                (0x20)         /* RX Error interrupt enable */
#define UCBRKIE                (0x10)         /* Break interrupt enable */
#define UCDORM                 (0x08)         /* Dormant (Sleep) Mode */
#define UCTXADDR               (0x04)         /* Send next Data as Address */
#define UCTXBRK                (0x02)         /* Send next Data as Break */
#define UCSWRST                (0x01)         /* USCI Software Reset */

// UCxxCTL1 SPI-Mode Control Bits
//#define res               (0x20)    /* reserved */
//#define res               (0x10)    /* reserved */
//#define res               (0x08)    /* reserved */
//#define res               (0x04)    /* reserved */
//#define res               (0x02)    /* reserved */

// UCBxCTL1 I2C-Mode Control Bits
//#define res               (0x20)    /* reserved */
#define UCTR                   (0x10)         /* Transmit/Receive Select/Flag */
#define UCTXNACK               (0x08)         /* Transmit NACK */
#define UCTXSTP                (0x04)         /* Transmit STOP */
#define UCTXSTT                (0x02)         /* Transmit START */
#define UCSSEL_0               (0x00)         /* USCI 0 Clock Source: 0 */
#define UCSSEL_1               (0x40)         /* USCI 0 Clock Source: 1 */
#define UCSSEL_2               (0x80)         /* USCI 0 Clock Source: 2 */
#define UCSSEL_3               (0xC0)         /* USCI 0 Clock Source: 3 */
#define UCSSEL__UCLK           (0x00)         /* USCI 0 Clock Source: UCLK */
#define UCSSEL__ACLK           (0x40)         /* USCI 0 Clock Source: ACLK */
#define UCSSEL__SMCLK          (0x80)         /* USCI 0 Clock Source: SMCLK */

/* UCAxMCTL Control Bits */
#define UCBRF3                 (0x80)         /* USCI First Stage Modulation Select 3 */
#define UCBRF2                 (0x40)         /* USCI First Stage Modulation Select 2 */
#define UCBRF1                 (0x20)         /* USCI First Stage Modulation Select 1 */
#define UCBRF0                 (0x10)         /* USCI First Stage Modulation Select 0 */
#define UCBRS2                 (0x08)         /* USCI Second Stage Modulation Select 2 */
#define UCBRS1                 (0x04)         /* USCI Second Stage Modulation Select 1 */
#define UCBRS0                 (0x02)         /* USCI Second Stage Modulation Select 0 */
#define UCOS16                 (0x01)         /* USCI 16-times Oversampling enable */

#define UCBRF_0                (0x00)         /* USCI First Stage Modulation: 0 */
#define UCBRF_1                (0x10)         /* USCI First Stage Modulation: 1 */
#define UCBRF_2                (0x20)         /* USCI First Stage Modulation: 2 */
#define UCBRF_3                (0x30)         /* USCI First Stage Modulation: 3 */
#define UCBRF_4                (0x40)         /* USCI First Stage Modulation: 4 */
#define UCBRF_5                (0x50)         /* USCI First Stage Modulation: 5 */
#define UCBRF_6                (0x60)         /* USCI First Stage Modulation: 6 */
#define UCBRF_7                (0x70)         /* USCI First Stage Modulation: 7 */
#define UCBRF_8                (0x80)         /* USCI First Stage Modulation: 8 */
#define UCBRF_9                (0x90)         /* USCI First Stage Modulation: 9 */
#define UCBRF_10               (0xA0)         /* USCI First Stage Modulation: A */
#define UCBRF_11               (0xB0)         /* USCI First Stage Modulation: B */
#define UCBRF_12               (0xC0)         /* USCI First Stage Modulation: C */
#define UCBRF_13               (0xD0)         /* USCI First Stage Modulation: D */
#define UCBRF_14               (0xE0)         /* USCI First Stage Modulation: E */
#define UCBRF_15               (0xF0)         /* USCI First Stage Modulation: F */

#define UCBRS_0                (0x00)         /* USCI Second Stage Modulation: 0 */
#define UCBRS_1                (0x02)         /* USCI Second Stage Modulation: 1 */
#define UCBRS_2                (0x04)         /* USCI Second Stage Modulation: 2 */
#define UCBRS_3                (0x06)         /* USCI Second Stage Modulation: 3 */
#define UCBRS_4                (0x08)         /* USCI Second Stage Modulation: 4 */
#define UCBRS_5                (0x0A)         /* USCI Second Stage Modulation: 5 */
#define UCBRS_6                (0x0C)         /* USCI Second Stage Modulation: 6 */
#define UCBRS_7                (0x0E)         /* USCI Second Stage Modulation: 7 */

