Sub-IoT/Sub-IoT-Stack/d7aoss/hal/cc430/driverlib/deprecated/CCS/msp430xgeneric.h
/* WDT-interval times [1ms] coded with Bits 0-2 */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MDLY_32         (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2)                         /* 32ms interval (default) */
#define WDT_MDLY_8          (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS0)                  /* 8ms     " */
#define WDT_MDLY_0_5        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS1)                  /* 0.5ms   " */
#define WDT_MDLY_0_064      (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTIS1+WDTIS0)           /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ADLY_1000       (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0)                /* 1000ms  " */
#define WDT_ADLY_250        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS0)         /* 250ms   " */
#define WDT_ADLY_16         (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS1)         /* 16ms    " */
#define WDT_ADLY_1_9        (WDTPW+WDTTMSEL+WDTCNTCL+WDTIS2+WDTSSEL0+WDTIS1+WDTIS0)  /* 1.9ms   " */
/* Watchdog mode -> reset after expired time */
/* WDT is clocked by fSMCLK (assumed 1MHz) */
#define WDT_MRST_32         (WDTPW+WDTCNTCL+WDTIS2)                                  /* 32ms interval (default) */
#define WDT_MRST_8          (WDTPW+WDTCNTCL+WDTIS2+WDTIS0)                           /* 8ms     " */
#define WDT_MRST_0_5        (WDTPW+WDTCNTCL+WDTIS2+WDTIS1)                           /* 0.5ms   " */
#define WDT_MRST_0_064      (WDTPW+WDTCNTCL+WDTIS2+WDTIS1+WDTIS0)                    /* 0.064ms " */
/* WDT is clocked by fACLK (assumed 32KHz) */
#define WDT_ARST_1000       (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2)                         /* 1000ms  " */
#define WDT_ARST_250        (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS0)                  /* 250ms   " */
#define WDT_ARST_16         (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS1)                  /* 16ms    " */
#define WDT_ARST_1_9        (WDTPW+WDTCNTCL+WDTSSEL0+WDTIS2+WDTIS1+WDTIS0)           /* 1.9ms   " */

#endif


/************************************************************
* CC1101 Radio for CC430
************************************************************/
#ifdef  __MSP430_HAS_CC1101__          /* Definition to show that Module is available */

#define OFS_RF1AIFCTL0         (0x0000)       /* Radio interface control register 0 */
#define OFS_RF1AIFCTL0_L       OFS_RF1AIFCTL0
#define OFS_RF1AIFCTL0_H       OFS_RF1AIFCTL0+1
#define OFS_RF1AIFCTL1         (0x0002)       /* Radio interface control register 1 */
#define OFS_RF1AIFCTL1_L       OFS_RF1AIFCTL1
#define OFS_RF1AIFCTL1_H       OFS_RF1AIFCTL1+1
#define  RF1AIFIFG             RF1AIFCTL1_L   /* Radio interface interrupt flag register */
#define  RF1AIFIE              RF1AIFCTL1_H   /* Radio interface interrupt enable register */
#define OFS_RF1AIFCTL2         (0x0004)       /* (Radio interface control register 2) */
#define OFS_RF1AIFCTL2_L       OFS_RF1AIFCTL2
#define OFS_RF1AIFCTL2_H       OFS_RF1AIFCTL2+1
#define OFS_RF1AIFERR          (0x0006)       /* Radio interface error flag register */
#define OFS_RF1AIFERR_L        OFS_RF1AIFERR
#define OFS_RF1AIFERR_H        OFS_RF1AIFERR+1
#define OFS_RF1AIFERRV         (0x000C)       /* Radio interface error vector word register */
#define OFS_RF1AIFERRV_L       OFS_RF1AIFERRV
#define OFS_RF1AIFERRV_H       OFS_RF1AIFERRV+1
#define OFS_RF1AIFIV           (0x000E)       /* Radio interface interrupt vector word register */
#define OFS_RF1AIFIV_L         OFS_RF1AIFIV
#define OFS_RF1AIFIV_H         OFS_RF1AIFIV+1
#define OFS_RF1ADINB           (0x0010)       /* Radio instruction word register */
#define OFS_RF1AINSTRW         (0x0010)       /* Radio instruction word register */
#define OFS_RF1AINSTRW_L       OFS_RF1AINSTRW
#define OFS_RF1AINSTRW_H       OFS_RF1AINSTRW+1
#define  RF1ADINB              RF1AINSTRW_L   /* Radio instruction byte register */
#define  RF1AINSTRB            RF1AINSTRW_H   /* Radio byte data in register */
#define OFS_RF1AINSTRB         (0x0011)       /* Radio instruction byte register */
#define OFS_RF1AINSTR1W        (0x0012)       /* Radio instruction 1-byte register with autoread */
#define OFS_RF1AINSTR1W_L      OFS_RF1AINSTR1W
#define OFS_RF1AINSTR1W_H      OFS_RF1AINSTR1W+1
#define  RF1AINSTR1B           RF1AINSTR1W_H  /* Radio instruction 1-byte register with autoread */
#define OFS_RF1AINSTR1B        (0x0013)       /* Radio instruction byte register with 1-byte auto-read */
#define OFS_RF1AINSTR2W        (0x0014)       /* Radio instruction 2-byte register with autoread */
#define OFS_RF1AINSTR2W_L      OFS_RF1AINSTR2W
#define OFS_RF1AINSTR2W_H      OFS_RF1AINSTR2W+1
#define  RF1AINSTR2B           RF1AINSTR1W_H  /* Radio instruction 2-byte register with autoread */
#define OFS_RF1ADINW           (0x0016)       /* Radio word data in register */
#define OFS_RF1ADINW_L         OFS_RF1ADINW
#define OFS_RF1ADINW_H         OFS_RF1ADINW+1

#define OFS_RF1ADOUTB          (0x0020)       /* Radio byte data out register without auto-read */
#define OFS_RF1ADOUT0B         (0x0020)       /* Radio byte data out register without auto-read */
#define OFS_RF1ASTAT0W         (0x0020)       /* Radio status word register without auto-read */
#define OFS_RF1ASTAT0W_L       OFS_RF1ASTAT0W
#define OFS_RF1ASTAT0W_H       OFS_RF1ASTAT0W+1
#define  RF1ADOUT0B            RF1ASTAT0W_L   /* Radio byte data out register without auto-read */
#define  RF1ASTAT0B            RF1ASTAT0W_H   /* Radio status byte register without auto-read */
#define  RF1ASTATW             RF1ASTAT0W     /* Radio status word register without auto-read */
#define  RF1ADOUTB             RF1ASTAT0W_L   /* Radio byte data out register without auto-read */
#define  RF1ASTATB             RF1ASTAT0W_H   /* Radio status byte register without auto-read */
#define OFS_RF1ASTATB          (0x0021)       /* Radio status byte register without auto-read */
#define OFS_RF1ADOUT1B         (0x0022)       /* Radio byte data out register with 1-byte auto-read */
#define OFS_RF1ASTAT1W         (0x0022)       /* Radio status word register with 1-byte auto-read */
#define OFS_RF1ASTAT1W_L       OFS_RF1ASTAT1W
#define OFS_RF1ASTAT1W_H       OFS_RF1ASTAT1W+1
#define  RF1ADOUT1B            RF1ASTAT1W_L   /* Radio byte data out register with 1-byte auto-read */
#define  RF1ASTAT1B            RF1ASTAT1W_H   /* Radio status byte register with 1-byte auto-read */
#define OFS_RF1ASTAT2W         (0x0024)       /* Radio status word register with 2-byte auto-read */
#define OFS_RF1ASTAT2W_L       OFS_RF1ASTAT2W
#define OFS_RF1ASTAT2W_H       OFS_RF1ASTAT2W+1
#define  RF1ADOUT2B            RF1ASTAT2W_L   /* Radio byte data out register with 2-byte auto-read */
#define  RF1ASTAT2B            RF1ASTAT2W_H   /* Radio status byte register with 2-byte auto-read */
#define OFS_RF1ADOUT0W         (0x0028)       /* Radio core word data out register without auto-read */
#define OFS_RF1ADOUT0W_L       OFS_RF1ADOUT0W
#define OFS_RF1ADOUT0W_H       OFS_RF1ADOUT0W+1
#define  RF1ADOUTW             RF1ADOUT0W     /* Radio core word data out register without auto-read */
#define  RF1ADOUTW_L           RF1ADOUT0W_L   /* Radio core word data out register without auto-read */
#define  RF1ADOUTW_H           RF1ADOUT0W_H   /* Radio core word data out register without auto-read */
#define OFS_RF1ADOUT1W         (0x002A)       /* Radio core word data out register with 1-byte auto-read */
#define OFS_RF1ADOUT1W_L       OFS_RF1ADOUT1W
#define OFS_RF1ADOUT1W_H       OFS_RF1ADOUT1W+1
#define OFS_RF1ADOUT2W         (0x002C)       /* Radio core word data out register with 2-byte auto-read */
#define OFS_RF1ADOUT2W_L       OFS_RF1ADOUT2W
#define OFS_RF1ADOUT2W_H       OFS_RF1ADOUT2W+1
#define OFS_RF1AIN             (0x0030)       /* Radio core signal input register */
#define OFS_RF1AIN_L           OFS_RF1AIN
#define OFS_RF1AIN_H           OFS_RF1AIN+1
#define OFS_RF1AIFG            (0x0032)       /* Radio core interrupt flag register */
#define OFS_RF1AIFG_L          OFS_RF1AIFG
#define OFS_RF1AIFG_H          OFS_RF1AIFG+1
#define OFS_RF1AIES            (0x0034)       /* Radio core interrupt edge select register */
#define OFS_RF1AIES_L          OFS_RF1AIES
#define OFS_RF1AIES_H          OFS_RF1AIES+1
#define OFS_RF1AIE             (0x0036)       /* Radio core interrupt enable register */
#define OFS_RF1AIE_L           OFS_RF1AIE
#define OFS_RF1AIE_H           OFS_RF1AIE+1
#define OFS_RF1AIV             (0x0038)       /* Radio core interrupt vector word register */
#define OFS_RF1AIV_L           OFS_RF1AIV
#define OFS_RF1AIV_H           OFS_RF1AIV+1
#define OFS_RF1ARXFIFO         (0x003C)       /* Direct receive FIFO access register */
#define OFS_RF1ARXFIFO_L       OFS_RF1ARXFIFO
#define OFS_RF1ARXFIFO_H       OFS_RF1ARXFIFO+1
#define OFS_RF1ATXFIFO         (0x003E)       /* Direct transmit FIFO access register */
#define OFS_RF1ATXFIFO_L       OFS_RF1ATXFIFO
#define OFS_RF1ATXFIFO_H       OFS_RF1ATXFIFO+1

